[
  {
    "id": 1,
    "title": "Mechanical Gaming Keyboard MK-Pro",
    "image": "https://images.unsplash.com/photo-1517336714731-489689fd1ca8",
    "description": "A high-performance mechanical gaming keyboard featuring ultra-responsive switches for precision and speed. Built with a durable aluminum frame and customizable RGB lighting effects. Perfect for competitive gamers and productivity users. Each keystroke is registered with lightning-fast accuracy, giving you the edge in fast-paced gaming scenarios. The hot-swappable switches allow you to customize your typing experience without soldering. With dedicated media controls and programmable macro keys, this keyboard adapts to your workflow seamlessly.",
    "price": 129.99,
    "meta": {
      "date": "2025-01-10",
      "priority": "high"
    }
  },
  {
    "id": 2,
    "title": "4K UltraWide Monitor 34\" FlexView",
    "image": "https://images.unsplash.com/photo-1527443224154-c4a3942d3acf",
    "description": "A stunning 34-inch UltraWide 4K display designed for creators, gamers, and productivity workflow. Delivers vibrant colors, high refresh rate, and flicker-free visuals. Ideal for coding, editing, and immersive media experiences. The curved screen provides an immersive viewing angle that reduces eye strain during extended work sessions. With HDR support and 99% sRGB color accuracy, your photos and videos appear with stunning realism. The ultra-thin bezels maximize screen real estate, while built-in blue light filters protect your eyes during late-night sessions.",
    "price": 499.0,
    "meta": {
      "date": "2025-01-08",
      "priority": "medium"
    }
  },
  {
    "id": 3,
    "title": "Wireless Smart Mouse X7",
    "image": "https://images.unsplash.com/photo-1527864550417-7fd91fc51a46",
    "description": "An ergonomic wireless mouse offering ultra-smooth tracking and silent clicks. Features adjustable DPI settings and a long-lasting battery that supports up to 60 days of use. Designed for both office work and gaming. The contoured shape fits naturally in your palm, reducing wrist fatigue during marathon work sessions. Advanced optical sensors ensure pixel-perfect precision on any surface, from glass desktops to fabric mouse pads. Quick-switch technology lets you connect to multiple devices instantly, making it perfect for hybrid work environments where you switch between laptop and desktop.",
    "price": 39.99,
    "meta": {
      "date": "2025-01-12",
      "priority": "low"
    }
  },
  {
    "id": 4,
    "title": "Portable SSD 2TB TurboDrive",
    "image": "https://images.unsplash.com/photo-1587829741301-dc798b83add3",
    "description": "A compact and shock-resistant portable SSD offering super-fast read and write speeds. Ideal for storing large project files, games, and backups. Designed for creators who need reliable and secure storage on the go. With transfer speeds up to 1050MB/s, you can move 4K videos and RAW photo libraries in seconds. The rugged aluminum enclosure protects your data from drops, water splashes, and extreme temperatures. Hardware encryption keeps your sensitive files secure, while the pocket-sized design slips easily into any bag or pocket for ultimate portability.",
    "price": 159.0,
    "meta": {
      "date": "2025-01-07",
      "priority": "high"
    }
  },
  {
    "id": 5,
    "title": "Smartwatch Apex S-Series",
    "image": "https://images.unsplash.com/photo-1579586337278-3befd40fd17a",
    "description": "A premium smartwatch with full health tracking, AMOLED display, and long battery life. Supports notifications, workouts, and advanced sensors. Built with a sleek metal body suitable for daily use. Monitor your heart rate, blood oxygen, sleep patterns, and stress levels with medical-grade accuracy. The always-on display remains visible in bright sunlight while conserving battery for up to 7 days of use. With over 100 workout modes, GPS tracking, and water resistance up to 50 meters, this watch is your perfect fitness companion whether you're swimming, running, or cycling.",
    "price": 229.99,
    "meta": {
      "date": "2025-01-02",
      "priority": "medium"
    }
  },
  {
    "id": 6,
    "title": "Noise Cancelling Headphones HX-900",
    "image": "https://images.unsplash.com/photo-1545127398-14699f92334b",
    "description": "Premium over-ear headphones with industry-leading noise cancellation. Offers deep bass, clear vocals, and up to 30 hours of continuous playback. Designed for music lovers, travelers, and remote workers. Advanced ANC technology blocks out airplane engines, traffic noise, and office chatter, creating your personal sound sanctuary. The plush memory foam ear cushions provide all-day comfort without pressure points or heat buildup. Multi-point Bluetooth connectivity lets you seamlessly switch between your phone, tablet, and laptop. With hi-res audio support and customizable EQ settings, every note sounds exactly as the artist intended.",
    "price": 179.99,
    "meta": {
      "date": "2025-01-11",
      "priority": "high"
    }
  },
  {
    "id": 7,
    "title": "USB-C Docking Station ProHub 8-in-1",
    "image": "https://images.unsplash.com/photo-1625948515291-69613efd103f",
    "description": "A versatile 8-in-1 docking station featuring HDMI, USB-C PD, SD card reader, Ethernet, and more. Perfect for laptops, tablets, and ultrabooks. Designed for seamless multitasking and workspace expansion. Transform your laptop into a full desktop setup with support for dual 4K displays at 60Hz. The 100W power delivery charges your device while transferring data at blazing speeds. Gigabit Ethernet ensures stable internet connections for video calls and large file transfers. The compact aluminum design dissipates heat efficiently and matches the aesthetic of modern workspaces perfectly.",
    "price": 69.99,
    "meta": {
      "date": "2025-01-04",
      "priority": "low"
    }
  },
  {
    "id": 8,
    "title": "Smart Home Speaker MiniBox",
    "image": "https://images.unsplash.com/photo-1608043152269-423dbba4e7e1",
    "description": "A compact smart speaker with powerful audio, voice assistant support, and multi-device integration. Ideal for home automation, music playback, and hands-free interaction. Despite its small footprint, the 360-degree sound fills your entire room with rich, balanced audio. Control your smart lights, thermostats, locks, and cameras with simple voice commands. The built-in privacy controls let you mute the microphone physically when you want complete privacy. Stream music from all major platforms, set timers, get weather updates, and create routines that automate your daily tasks effortlessly.",
    "price": 49.99,
    "meta": {
      "date": "2025-01-09",
      "priority": "medium"
    }
  },
  {
    "id": 9,
    "title": "LED Work Light DeskPro",
    "image": "https://images.unsplash.com/photo-1493666438817-866a91353ca9",
    "description": "A modern LED desk lamp with adjustable brightness, flexible arm, and eye-friendly illumination. Great for study, programming, or creative workspaces with minimal eye strain. Choose from multiple color temperature modes ranging from warm amber to cool daylight to match your task and time of day. The weighted base provides rock-solid stability while the articulating arm positions light exactly where you need it. Advanced LED technology delivers flicker-free, glare-free illumination that reduces eye fatigue during long work sessions. Built-in USB charging port keeps your devices powered while you work, and the touch-sensitive controls respond instantly to your adjustments.",
    "price": 24.99,
    "meta": {
      "date": "2025-01-03",
      "priority": "low"
    }
  },
  {
    "id": 10,
    "title": "Laptop Cooling Pad AeroCool",
    "image": "https://images.unsplash.com/photo-1517336714731-489689fd1ca8",
    "description": "A high-performance cooling pad featuring dual silent fans and adjustable height settings. Helps maintain laptop performance during gaming, editing, or long productivity sessions. The whisper-quiet fans spin at optimized speeds to maximize airflow while minimizing noise distraction. Five adjustable height positions let you find the perfect ergonomic angle for your neck and wrists. The metal mesh surface provides excellent heat dissipation while the non-slip grips keep your laptop securely in place. Built-in USB hub adds extra ports for your peripherals, and the slim profile makes it easy to pack for travel or store when not in use.",
    "price": 34.99,
    "meta": {
      "date": "2025-01-06",
      "priority": "high"
    }
  }
]
